import random
g1 = ["Иванов", "константинова", "Сайманова", "гришечкина", "Кузмин", "Василько", "Антонов", "Рысев", "Гребенкин", "Михеев"]
g2 = ["Симаков", "Гошкина", "Пупкин", "Тарасов", "Ильченко", "Елизаветьевна", "Ушаков", "Пашонян", "Баранов", "Баланцев"]

t = tuple(random.sample(g1, 5) + random.sample(g2, 5))

print("Группа 1: ", ", ".join(g1))
print("Группа 2: ", ", ".join(g2))
print("Команда: ", ", ".join(t))
print("Длина кортежа: ", len(t))

newt = tuple(sorted(t))
print("Команда по алфавиту: ", ", ".join(newt))

iv = 0
for i in t:
    if i == "Иванов" or i == "иванов":
        iv += 1
print("Фамилия 'Иванов' в команде встречается: ", iv, " раз")
